# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "tap noahgorstein/tap"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'tree'
brew 'node'
brew 'trash'
brew 'wget'
brew 'gh'
brew 'ripgrep'
brew 'aws-nuke'
brew 'fish'
brew 'jq'
brew 'noahgorstein/tap/jqp'
brew 'yq'
brew 'fd'
brew 'bat'
brew 'bat-extras'
brew 'xh'
brew 'fzf'

# Languages
brew 'goenv'
brew 'pyenv'

# Containers-related
brew 'arkade'
brew 'docker'

# Apps
# TODO add mac only section or brewfile
brew "mas"
cask 'iterm2'
cask 'skype'
cask 'slack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts

