# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "tap noahgorstein/tap"

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# S-tier tools
brew 'awscli'
brew 'git'
brew 'git-delta'
brew 'tree'
brew 'trash'
brew 'wget'
brew 'ripgrep'
brew 'fish'
brew 'fisher'
brew 'jq'
brew 'yq'
brew 'fd'
brew 'bat'
brew 'bat-extras'
brew 'fzf'
brew 'stow'

# zsh plugins
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'olets/tap/zsh-abbr'
brew 'zoxide'

# B-tier tools
brew 'aws-nuke'
brew 'noahgorstein/tap/jqp'
brew 'xh'

# Git extensions
brew 'git-extras'
brew 'git-lfs'
brew 'git-absorb'
brew 'git-branchless'
brew 'lazygit'

# Github
brew 'gh'
brew 'hub'

# Tmux
brew 'tmux'
brew 'tpm'

# Languages
brew 'go'
brew 'golangci-lint'
brew 'pyenv'
brew 'node'
brew 'python'

# Networking
brew 'mtr'
brew 'nmap'
brew 'net-tools'

# Containers-related
brew 'arkade'
brew 'docker'
brew 'stern'
brew 'eksctl'
brew 'helm'
brew 'kubectl'

# Install $OSTYPE.$PLATFORM specific packages
main ./Brewfile.$OSTYPE
