# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "tap noahgorstein/tap"

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'tree'
brew 'node'
brew 'trash'
brew 'wget'
brew 'ripgrep'
brew 'aws-nuke'
brew 'fish'
brew 'jq'
brew 'noahgorstein/tap/jqp'
brew 'yq'
brew 'fd'
brew 'bat'
brew 'bat-extras'
brew 'xh'
brew 'fzf'
brew 'stow'

# Git extensions
brew 'git-extras'
brew 'git-lfs'
brew 'git-absorb'
brew 'git-branchless'

# Github
brew 'gh'
brew 'hub'

# Languages
brew 'go'
brew 'pyenv'

# Containers-related
brew 'arkade'
brew 'docker'

# Install $OSTYPE.$PLATFORM specific packages
main ./Brewfile.$OSTYPE
